package com.okccc.app.dwd;

/**
 * @Author: okccc
 * @Date: 2023/3/29 10:26:40
 * @Desc: 流量域 - 用户跳出明细(DataStream - KafkaSource - FlinkCEP - KafkaSink)
 *
 * 跳转：用户访问网站某个页面后继续访问其他页面,跳转率=跳转次数/访问次数,可以推断用户流失、订单转化、漏斗分析...
 * 跳出：用户的某次会话只访问了一个页面就退出了,跳出率=跳出次数/访问次数,可以推断渠道引流用户质量、应用页面优化效果...
 * 离线：可以获取一整天的数据,统计所有会话的页面数,筛选出页面数等于1的会话即可
 * 实时：有的用户会"装死",既不退出也不浏览就挂在那,肯定不能一直等下去,比如十分钟没动静就算跳出,条件判断加超时事件的组合用FlinkCEP
 * 情况1：两条紧邻的首页日志进入算子,那么第一条首页日志判定为跳出
 * 情况2：第一条首页日志进入算子,超时时间内没有收到第二条日志,那么第一条首页日志也判定为跳出
 * 情况3：第一条首页日志进入算子,超时时间内收到的第二条日志为非首页日志,那么第一条首页日志是跳转
 */